Задание
Вывести название образовательной программы и фамилию тех абитуриентов, которые подавали документы на эту образовательную программу, 
но не могут быть зачислены на нее. Эти абитуриенты имеют результат по одному или нескольким предметам ЕГЭ, 
необходимым для поступления на эту образовательную программу, меньше минимального балла. 
Информацию вывести в отсортированном сначала по программам, а потом по фамилиям абитуриентов виде.
Например, Баранов Павел по «Физике» набрал 41 балл, 
а для образовательной программы «Прикладная механика» минимальный балл по этому предмету определен в 45 баллов. Следовательно, 
абитуриент на данную программу не может поступить.

Решение:
SELECT name_program, name_enrollee
FROM enrollee
JOIN program_enrollee USING(enrollee_id)
JOIN program USING(program_id)
JOIN program_subject USING(program_id)
JOIN enrollee_subject USING(subject_id, enrollee_id)
WHERE result < min_result
GROUP BY name_program, name_enrollee
ORDER BY name_program;